zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_rtc_ex.c
  /* Monotonic 1 registers privilege configuration */
  privilegeState->MonotonicCounterPrivilege = READ_BIT(tamp_privcfgr, TAMP_PRIVCR_CNT1PRIV);

  /* Monotonic 2 registers privilege configuration */
  privilegeState->MonotonicCounter2Privilege = READ_BIT(tamp_privcfgr, TAMP_PRIVCR_CNT2PRIV);

  /* Backup registers Zones */
  privilegeState->backupRegisterPrivZone = READ_BIT(tamp_privcfgr, (TAMP_PRIVCR_BKPWPRIV | TAMP_PRIVCR_BKPRWPRIV));

  /* Backup register start zones
     Warning : Shared with secure configuration */
  privilegeState->backupRegisterStartZone2 = READ_BIT(tamp_seccfgr, TAMP_SECCFGR_BKPRWSEC) >> TAMP_SECCFGR_BKPRWSEC_Pos;
  privilegeState->backupRegisterStartZone3 = READ_BIT(tamp_seccfgr, TAMP_SECCFGR_BKPWSEC) >> TAMP_SECCFGR_BKPWSEC_Pos;

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup RTCEx_Exported_Functions_Group9
  * @brief      Extended RTC CID filtering functions
  *
@verbatim
  ===============================================================================
             ##### Extended RTC CID filtering functions #####
  ===============================================================================
  [..]
   (+) Before calling privilege function, you have to call first
       HAL_RTC_Init() function.
@endverbatim
  * @{
  */


/**
  * @brief  Set the CID filtering of the RTC/TAMP registers.
  *         To get the current CID filtering call HAL_RTCEx_CidModeGet.
  * @param  hrtc RTC handle
  * @param  cidState  CID filtering state
  * @retval HAL_StatusTypeDef
  */
HAL_StatusTypeDef HAL_RTCEx_CidModeSet(const RTC_HandleTypeDef *hrtc, const RTC_CidStateTypeDef *cidState)
{
  UNUSED(hrtc);
  assert_param(IS_RTC_CID(cidState->rtcCidAlrA));
  assert_param(IS_RTC_CID(cidState->rtcCidAlrB));
  assert_param(IS_RTC_CID(cidState->rtcCidWut));
  assert_param(IS_RTC_CID(cidState->rtcCidTs));
  assert_param(IS_RTC_CID(cidState->rtcCidInit));
  assert_param(IS_RTC_CID(cidState->rtcCidCal));

  assert_param(IS_TAMP_CID(cidState->tampCidTampBk0));
  assert_param(IS_TAMP_CID(cidState->tampCidMon1Bk1));
  assert_param(IS_TAMP_CID(cidState->tampCidMon2Bk2));
  assert_param(IS_RTC_BKP(cidState->backupRegisterStartZone2));
  assert_param(IS_RTC_BKP(cidState->backupRegisterStartZone3));
  assert_param(IS_RTC_BKP(cidState->backupRegisterStartRif2Zone1));
  assert_param(IS_RTC_BKP(cidState->backupRegisterStartRif2Zone2));
  assert_param(IS_RTC_BKP(cidState->backupRegisterStartRif0Zone3));
  assert_param(IS_RTC_BKP(cidState->backupRegisterStartRif2Zone3));


  /* Remove the RTC current configuration */
  RTC->RCIDCFGR[0] = 0;
  RTC->RCIDCFGR[1] = 0;
  RTC->RCIDCFGR[2] = 0;
  RTC->RCIDCFGR[3] = 0;
  RTC->RCIDCFGR[4] = 0;
  RTC->RCIDCFGR[5] = 0;

  /* Set the RTC CID configuration */
  if ((cidState->rtcCidAlrA & RTC_CID_DISABLE) != RTC_CID_DISABLE)
  {
    WRITE_REG(RTC->RCIDCFGR[0], ((cidState->rtcCidAlrA & RTC_RCIDCFGR_CID_Msk) | RTC_RCIDCFGR_CFEN));
  }
  if ((cidState->rtcCidAlrB & RTC_CID_DISABLE) != RTC_CID_DISABLE)
  {
    WRITE_REG(RTC->RCIDCFGR[1], ((cidState->rtcCidAlrB & RTC_RCIDCFGR_CID_Msk) | RTC_RCIDCFGR_CFEN));
  }
  if ((cidState->rtcCidWut & RTC_CID_DISABLE) != RTC_CID_DISABLE)
  {
    WRITE_REG(RTC->RCIDCFGR[2], ((cidState->rtcCidWut & RTC_RCIDCFGR_CID_Msk) | RTC_RCIDCFGR_CFEN));
  }
  if ((cidState->rtcCidTs & RTC_CID_DISABLE) != RTC_CID_DISABLE)
  {
    WRITE_REG(RTC->RCIDCFGR[3], ((cidState->rtcCidTs & RTC_RCIDCFGR_CID_Msk) | RTC_RCIDCFGR_CFEN));
  }
  if ((cidState->rtcCidInit & RTC_CID_DISABLE) != RTC_CID_DISABLE)
  {
    WRITE_REG(RTC->RCIDCFGR[4], ((cidState->rtcCidInit & RTC_RCIDCFGR_CID_Msk) | RTC_RCIDCFGR_CFEN));
  }
  if ((cidState->rtcCidCal & RTC_CID_DISABLE) != RTC_CID_DISABLE)
  {
    WRITE_REG(RTC->RCIDCFGR[5], ((cidState->rtcCidCal & RTC_RCIDCFGR_CID_Msk) | RTC_RCIDCFGR_CFEN));
  }

  return HAL_OK;
}

/**
  * @brief  Get the CID filtering of the RTC/TAMP.
  *         To set the CID filtering please call HAL_RTCEx_PrivilegeModeSet.
  * @param  hrtc RTC handle
  * @param  cidState  CID filtering state
  * @retval HAL_StatusTypeDef
  */
HAL_StatusTypeDef HAL_RTCEx_CidModeGet(const RTC_HandleTypeDef *hrtc, RTC_CidStateTypeDef *cidState)
{
  /* Read registers */
  uint32_t tamp_seccfgr = READ_REG(TAMP->SECCFGR);
  uint32_t tamp_bkprif3 = READ_REG(TAMP->BKPRIFR3);

  UNUSED(hrtc);
  /* RTC CID configuration */
  cidState->rtcCidAlrA = READ_REG(RTC->RCIDCFGR[0]) & RTC_RCIDCFGR_CID_Msk;
  cidState->rtcCidAlrB = READ_REG(RTC->RCIDCFGR[1]) & RTC_RCIDCFGR_CID_Msk;
  cidState->rtcCidWut = READ_REG(RTC->RCIDCFGR[2]) & RTC_RCIDCFGR_CID_Msk;
  cidState->rtcCidTs = READ_REG(RTC->RCIDCFGR[3]) & RTC_RCIDCFGR_CID_Msk;
  cidState->rtcCidInit = READ_REG(RTC->RCIDCFGR[4]) & RTC_RCIDCFGR_CID_Msk;
  cidState->rtcCidCal = READ_REG(RTC->RCIDCFGR[5]) & RTC_RCIDCFGR_CID_Msk;

  /* Backup register start zones
     Warning : Shared with secure configuration */
  cidState->backupRegisterStartZone2 = READ_BIT(tamp_seccfgr, TAMP_SECCFGR_BKPRWSEC) >> TAMP_SECCFGR_BKPRWSEC_Pos;
  cidState->backupRegisterStartZone3 = READ_BIT(tamp_seccfgr, TAMP_SECCFGR_BKPWSEC) >> TAMP_SECCFGR_BKPWSEC_Pos;

  /* Backup register start RIF protection zone */
  cidState->backupRegisterStartRif2Zone1 = READ_REG(TAMP->BKPRIFR1) >> TAMP_BKPRIFR1_BKPRWRIF_Pos;
  cidState->backupRegisterStartRif2Zone2 = READ_REG(TAMP->BKPRIFR2) >> TAMP_BKPRIFR2_BKPRWRIF_Pos;
  cidState->backupRegisterStartRif0Zone3 = READ_BIT(tamp_bkprif3, TAMP_BKPRIFR3_BKPRWRIF1
                                                   ) >> TAMP_BKPRIFR3_BKPRWRIF1_Pos;
  cidState->backupRegisterStartRif2Zone3 = READ_BIT(tamp_bkprif3, TAMP_BKPRIFR3_BKPRWRIF2
                                                   ) >> TAMP_BKPRIFR3_BKPRWRIF2_Pos;

  /* TAMP CID configuration */
  cidState->tampCidTampBk0 = READ_REG(TAMP->RCIDCFGR[0]) & TAMP_RCIDCFGR_CID_Msk;
  cidState->tampCidMon1Bk1 = READ_REG(TAMP->RCIDCFGR[1]) & TAMP_RCIDCFGR_CID_Msk;
  cidState->tampCidMon2Bk2 = READ_REG(TAMP->RCIDCFGR[2]) & TAMP_RCIDCFGR_CID_Msk;

  return HAL_OK;
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_RTC_MODULE_ENABLED */

/**
  * @}
  */


/**
  * @}
  */
